# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\DD\Final PSCO 10-08-2020\4_1_new\Design01.cydsn\I2C_Bootloader_Red.cydsn\I2C_Bootloader_Red.cyprj
# Date: Mon, 07 Sep 2020 05:10:24 GMT
#set_units -time ns
create_clock -name {Clock(FFB)} -period 5000000 -waveform {0 2500000} [list [get_pins {ClockBlock/ff_div_8}]]
create_clock -name {I2C_SCBCLK(FFB)} -period 625 -waveform {0 312.5} [list [get_pins {ClockBlock/ff_div_3}]]
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {Clock} -source [get_pins {ClockBlock/hfclk}] -edges {1 120001 240001} [list]
create_generated_clock -name {I2C_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 15 31} [list]


# Component constraints for D:\DD\Final PSCO 10-08-2020\4_1_new\Design01.cydsn\I2C_Bootloader_Red.cydsn\TopDesign\TopDesign.cysch
# Project: D:\DD\Final PSCO 10-08-2020\4_1_new\Design01.cydsn\I2C_Bootloader_Red.cydsn\I2C_Bootloader_Red.cyprj
# Date: Mon, 07 Sep 2020 05:10:22 GMT
